pouriaMaleki/navon/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The Waveshare ESP32-P4-Module-DEV-KIT ships with 32 MB of SPI flash.
# Without this the image header reports 4 MB and the bootloader warns
# "Detected size(32768k) larger than the size in the binary image header".
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# Custom partition layout. The `factory` slot is 4 MB (firmware is ~1 MB).
# The `map_data` slot follows at 0x400000 and ends at 0x1000000 (16 MB),
# staying within the range the ESP-IDF generic flash driver can mmap.
# The default `partitions_singleapp.csv` gives only 1 MB of factory space.
# embuild's `PROJECT_DIR` points at `/work/target`, not the crate source,
# so resolve the CSV via an absolute path rather than a crate-relative one.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/work/firmware/partitions.csv"

# Watchdog / task stacks for a simple main loop.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_INIT=y

# Log everything at INFO by default.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Waveshare ESP32-P4-Module-DEV-KIT has 32MB HyperBus PSRAM (hex mode).
# We use PSRAM for the heap only — keep code/rodata in internal flash/SRAM.
# Code-placement options (FETCH_INSTRUCTIONS, RODATA, XIP_FROM_PSRAM) all
# enable ld's `--enable-non-contiguous-regions`, which discards orphan
# sections produced by `-Zbuild-std`. If the app outgrows internal SRAM
# we revisit flash XIP rather than PSRAM XIP to keep orphan handling sane.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# CONFIG_SPIRAM_SPEED_200M is gated behind CONFIG_IDF_EXPERIMENTAL_FEATURES
# in ESP-IDF v5.4's Kconfig for esp32p4 — without that flag, kconfig
# silently selects SPIRAM_SPEED_20M. That default costs ~10x of the
# framebuffer bandwidth, which dominates the 800x800 render budget.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# Keep the SPIRAM malloc threshold at the default 16 KiB; small allocations
# stay on internal SRAM so touch / frame tick structs don't pay PSRAM latency.

# Speed-optimize IDF so the 2.56 MB framebuffer clear / blit path is not
# hobbled by -Os. The Rust side is still opt-level=s for binary size, but
# the hot render path is mostly in the Rust rasterizer (render-core), which
# is also set to opt-level=3 below via firmware/.cargo/config.toml.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Disable C++ exceptions and RTTI so libstdc++'s eh_globals / type_info
# objects are not dragged into the link. The Rust binary does not need them.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
